name: Custom - Baseline of DNS Traffic by src - MLTK
id: 3304b56e-0b55-11ed-861d-0242ac120002
version: 1
date: '2022-07-22'
author: dlam
type: Baseline
datamodel:
- Network_Resolution
description: This search is used to build a Machine Learning Toolkit (MLTK) model
  to characterize the number of DNS queries observed each hour for every day of
  week. By default, the search uses the last 30 days of data to build the model. The
  model created by this search is then used in the corresponding detection search
  to identify outliers in the number of DNS queries
search: '| tstats `security_content_summariesonly` 
count values(DNS.query) as query values(DNS.dest) as dest from datamodel=Network_Resolution 
where NOT DNS.message_type IN("Pointer","PTR") AND (DNS.src=10.0.0.0/8 OR DNS.src=192.168.0.0/16 OR DNS.src=172.16.0.0/12 ) AND (DNS.src!="unknown" DNS.query!="unknown" AND DNS.query!="*addr.arpa" AND DNS.query!="*ip6.arpa" AND DNS.query!="*.local") 
by _time span=1m DNS.src
| `drop_dm_object_name("DNS")`
|search count>20
| bucket _time AS bucket span=10m
| eventstats avg(count) as avg_queries stdev(count) AS stdev_queries p50(count) AS p50_queries p90(count) AS p90_queries by bucket src
| eval z_score=(count-avg_queries)/stdev_queries
|search z_score>0
|table _time src dest query avg_queries bucket stdev_queries p50_queries p90_queries z_score 
|fit DensityFunction p50_queries show_density=True partial_fit=true dist=norm into app:dns_queries_src_1h'
how_to_implement: You must be ingesting network traffic and populating the Network_Traffic
  data model with DNS. In addition, you must have the Machine Learning Toolkit (MLTK) version
  >= 4.2 installed, along with any required dependencies. To improve your results,
  you may consider adding "src" to the by clause, which will build the model for each
  unique source in your enviornment. However, if you have a large number of hosts
  in your environment, this search may be very resource intensive. In this case, you
  may need to raise the value of max_inputs and/or max_groups in the MLTK settings
  for the DensityFunction algorithm, then ensure that the search completes in a reasonable
  timeframe. By default, the search builds the model using the past 30 days of data.
  You can modify the search window to build the model over a longer period of time,
  which may give you better results. You may also want to periodically re-run this
  search to rebuild the model with the latest data. More information on the algorithm
  used in the search can be found at `https://docs.splunk.com/Documentation/MLApp/4.2.0/User/Algorithms#DensityFunction`.
references: []
tags:
  analytic_story:
  - Suspicious Network Activity - Behavior
  detections:
  - Custom - Potential suspicious DNS tunneling 
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud